# TargetDocument Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransferredProjectStandardsEventArgs..::..TargetDocument Property
TransferredProjectStandardsEventArgs Class See Also
---
Target document.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017.2
# Syntax
C#
---
```text
public Document TargetDocument { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TargetDocument As Document
	Get
```

Visual C++
---
```text
public:
property Document^ TargetDocument {
	Document^ get ();
}
```

# See Also
TransferredProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace